#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_eks_cluster.tc_eks_cluster: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_eks_cluster.tc_eks_cluster: Read complete after 0s [id=eks_vid-proc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.status will be created
  + resource "helm_release" "status" {
      + atomic                     = false
      + chart                      = "../Helm/status_tracking-chart"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "status"
      + namespace                  = "dev"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                namespace: default
                
                # API
                apiName: status-tracking-api
                apiImage: 
                  name: brunapisera/status-tracking-api
                  tag: latest
                apiNodePort: 30200
                
                # Config map
                configmap:
                  name: status-config-map
                  data:
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                # Secret
                secret:
                  name: status-secret
                
                rds:
                  host: 
                  dbName: 
                  user: 
                  password:
            EOT,
          + <<-EOT
                namespace: dev
                
                # API
                apiName: process-service
                apiImage: 
                  name: brunapisera/process-service
                  tag: latest
                apiNodePort: 30200
                
                # Secret
                secret:
                  name: process-secret
                
                rabbitmq:
                  username: xtpbliuz 
                  hostname: woodpecker-01.rmq.cloudamqp.com
                  password: 
                  port: 5672
                  virtualhost: xtpbliuz
                
                rds:
                  host: 
                  dbName: vidproc
                  user: tc3user
                  password: Posgraduation109283
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "rabbitmq.password"
          + value = "9DY0qxnfnjCLAZeBl7vBxoiaTOubFIKe"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rds.host"
          + value = "tc-pg-db.cdprsirdrekm.us-east-1.rds.amazonaws.com"
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*